src/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РасходнаяНакладная/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает выборку товаров документа сгруппированных по Номенклатуре
// Параметры:
//  документСсылка - ДокументСсылка.РасходнаяНакладная
//  выгрузить - Булево - Если Истина результат запроса будет выгружен в `ТаблицуЗначений`
// Возвращаемое значение:
//  - ВыборкаИзРезультатаЗапроса
//  - ТаблицаЗначений
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Количество - Число
//  - Неопределено - Если таблица не заполнена
Функция ПолучитьТоварыДокумента(Знач документСсылка, Знач выгрузить = Истина) Экспорт
    запросТовары = Новый Запрос;
    запросТовары.УстановитьПараметр("Ссылка", документСсылка);
    запросТовары.Текст =
        "ВЫБРАТЬ
        |	РасходнаяНакладная.Номенклатура КАК Номенклатура,
        |	СУММА(РасходнаяНакладная.Количество) КАК Количество,
        |	СУММА(РасходнаяНакладная.Цена) КАК Цена,
        |	СУММА(РасходнаяНакладная.Сумма) КАК Сумма
        |ИЗ
        |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладная
        |ГДЕ
        |	РасходнаяНакладная.Ссылка = &Ссылка
        |
        |СГРУППИРОВАТЬ ПО
        |	РасходнаяНакладная.Номенклатура
        |";

    результатЗапроса = запросТовары.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить = Истина Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
